remotemcu/remcu_examples/stm32f3_discovery/accell_graph/stm32f3_discovery_lsm303dlhc.h
/**
  ******************************************************************************
  * @file    stm32f3_discovery_lsm303dlhc.h
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    20-September-2012
  * @brief   This file contains definitions for stm32f3_discovery_lsm303dlhc.c 
  *          firmware driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */
  

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F3_DISCOVERY_LSM303DLHC_H
#define __STM32F3_DISCOVERY_LSM303DLHC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
  #include "remcu.h"
 #include "stm32f30x.h"

/** @addtogroup Utilities
  * @{
  */
  
/** @addtogroup STM32F3_DISCOVERY
  * @{
  */ 

/** @addtogroup STM32F3_DISCOVERY_LSM303DLHC
  * @{
  */
  
/** @defgroup STM32F3_DISCOVERY_LSM303DLHC_Exported_Types
  * @{
  */

/** 
  * @brief  LSM303DLHC Status  
  */ 

/* LSM303DLHC ACC struct */
typedef struct
{
  uint8_t Power_Mode;                         /* Power-down/Normal Mode */
  uint8_t AccOutput_DataRate;                 /* OUT data rate */
  uint8_t Axes_Enable;                        /* Axes enable */
  uint8_t High_Resolution;                    /* High Resolution enabling/disabling */
  uint8_t BlockData_Update;                   /* Block Data Update */
  uint8_t Endianness;                         /* Endian Data selection */
  uint8_t AccFull_Scale;                      /* Full Scale selection */
}LSM303DLHCAcc_InitTypeDef;

/* LSM303DLHC Acc High Pass Filter struct */
typedef struct
{
  uint8_t HighPassFilter_Mode_Selection;      /* Internal filter mode */
  uint8_t HighPassFilter_CutOff_Frequency;    /* High pass filter cut-off frequency */
  uint8_t HighPassFilter_AOI1;                /* HPF_enabling/disabling for AOI function on interrupt 1 */
  uint8_t HighPassFilter_AOI2;                /* HPF_enabling/disabling for AOI function on interrupt 2 */
}LSM303DLHCAcc_FilterConfigTypeDef;

/* LSM303DLHC Mag struct */
typedef struct
{
  uint8_t Temperature_Sensor;                /* Temperature sensor enable/disable */
  uint8_t MagOutput_DataRate;                /* OUT data rate */
  uint8_t Working_Mode;                      /* operating mode */
  uint8_t MagFull_Scale;                     /* Full Scale selection */
}LSM303DLHCMag_InitTypeDef;
/**
  * @}
  */
  
/** @defgroup STM32F3_DISCOVERY_LSM303DLHC_Exported_Constants
  * @{
  */
#define LSM303DLHC_OK                       ((uint32_t) 0)
#define LSM303DLHC_FAIL                     ((uint32_t) 0)

/* Uncomment the following line to use the default LSM303DLHC_TIMEOUT_UserCallback() 
   function implemented in stm32f3_discovery_lgd20.c file.
   LSM303DLHC_TIMEOUT_UserCallback() function is called whenever a timeout condition 
   occure during communication (waiting transmit data register empty flag(TXE)
   or waiting receive data register is not empty flag (RXNE)). */   
/* #define USE_DEFAULT_TIMEOUT_CALLBACK */

/* Maximum Timeout values for flags waiting loops. These timeouts are not based
   on accurate values, they just guarantee that the application will not remain
   stuck if the I2C communication is corrupted.
   You may modify these timeout values depending on CPU frequency and application
   conditions (interrupts routines ...). */   
#define LSM303DLHC_FLAG_TIMEOUT             ((uint32_t)0x1000)
#define LSM303DLHC_LONG_TIMEOUT             ((uint32_t)(10 * LSM303DLHC_FLAG_TIMEOUT))  
/**
  * @brief  LSM303DLHC I2C Interface pins
  */
#define LSM303DLHC_I2C                       I2C1
#define LSM303DLHC_I2C_CLK                   RCC_APB1Periph_I2C1

#define LSM303DLHC_I2C_SCK_PIN               GPIO_Pin_6                  /* PB.06 */
#define LSM303DLHC_I2C_SCK_GPIO_PORT         GPIOB                       /* GPIOB */
#define LSM303DLHC_I2C_SCK_GPIO_CLK          RCC_AHBPeriph_GPIOB
#define LSM303DLHC_I2C_SCK_SOURCE            GPIO_PinSource6
#define LSM303DLHC_I2C_SCK_AF                GPIO_AF_4

#define LSM303DLHC_I2C_SDA_PIN               GPIO_Pin_7                  /* PB.7 */
#define LSM303DLHC_I2C_SDA_GPIO_PORT         GPIOB                       /* GPIOB */
#define LSM303DLHC_I2C_SDA_GPIO_CLK          RCC_AHBPeriph_GPIOB
#define LSM303DLHC_I2C_SDA_SOURCE            GPIO_PinSource7
#define LSM303DLHC_I2C_SDA_AF                GPIO_AF_4

#define LSM303DLHC_DRDY_PIN                  GPIO_Pin_2                  /* PE.02 */
#define LSM303DLHC_DRDY_GPIO_PORT            GPIOE                       /* GPIOE */
#define LSM303DLHC_DRDY_GPIO_CLK             RCC_AHBPeriph_GPIOE
#define LSM303DLHC_DRDY_EXTI_LINE            EXTI_Line2
#define LSM303DLHC_DRDY_EXTI_PORT_SOURCE     EXTI_PortSourceGPIOE
#define LSM303DLHC_DRDY_EXTI_PIN_SOURCE      EXTI_PinSource2
#define LSM303DLHC_DRDY_EXTI_IRQn            EXTI2_TS_IRQn 

#define LSM303DLHC_I2C_INT1_PIN              GPIO_Pin_4                  /* PE.04 */
#define LSM303DLHC_I2C_INT1_GPIO_PORT        GPIOE                       /* GPIOE */
#define LSM303DLHC_I2C_INT1_GPIO_CLK         RCC_AHBPeriph_GPIOE
#define LSM303DLHC_I2C_INT1_EXTI_LINE        EXTI_Line4
#define LSM303DLHC_I2C_INT1_EXTI_PORT_SOURCE EXTI_PortSourceGPIOE
#define LSM303DLHC_I2C_INT1_EXTI_PIN_SOURCE  EXTI_PinSource4
#define LSM303DLHC_I2C_INT1_EXTI_IRQn        EXTI4_IRQn 

